In [1]:
%config Completer.use_jedi = False

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introducción" data-toc-modified-id="Introducción-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introducción</a></span></li><li><span><a href="#Instalación" data-toc-modified-id="Instalación-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Instalación</a></span></li><li><span><a href="#Introducción-a-las-estructuras-de-datos-de-pandas" data-toc-modified-id="Introducción-a-las-estructuras-de-datos-de-pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introducción a las estructuras de datos de pandas</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Buscar-valores-NaN" data-toc-modified-id="Buscar-valores-NaN-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Buscar valores NaN</a></span></li></ul></li><li><span><a href="#Datos-de-lectura/escritura" data-toc-modified-id="Datos-de-lectura/escritura-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Datos de lectura/escritura</a></span><ul class="toc-item"><li><span><a href="#Cargamos-datos-de-formato-CSV" data-toc-modified-id="Cargamos-datos-de-formato-CSV-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Cargamos datos de formato CSV</a></span></li><li><span><a href="#Cargamos-datos-de-formato-xlsx" data-toc-modified-id="Cargamos-datos-de-formato-xlsx-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Cargamos datos de formato xlsx</a></span></li><li><span><a href="#Visualizamos-las-primeras-filas" data-toc-modified-id="Visualizamos-las-primeras-filas-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Visualizamos las primeras filas</a></span></li><li><span><a href="#Visualizamos-las-últimas-filas" data-toc-modified-id="Visualizamos-las-últimas-filas-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Visualizamos las últimas filas</a></span></li><li><span><a href="#Visualizamos-una-muestra-aleatoria" data-toc-modified-id="Visualizamos-una-muestra-aleatoria-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Visualizamos una muestra aleatoria</a></span></li></ul></li><li><span><a href="#Análisis-exploratorio-de-un-dataframe" data-toc-modified-id="Análisis-exploratorio-de-un-dataframe-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Análisis exploratorio de un dataframe</a></span></li><li><span><a href="#Operaciones-básicas-con-los-dataframes" data-toc-modified-id="Operaciones-básicas-con-los-dataframes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Operaciones básicas con los dataframes</a></span><ul class="toc-item"><li><span><a href="#Seleccionamos-una-columna" data-toc-modified-id="Seleccionamos-una-columna-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Seleccionamos una columna</a></span></li><li><span><a href="#Seleccionamos-varias-columnas" data-toc-modified-id="Seleccionamos-varias-columnas-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Seleccionamos varias columnas</a></span></li></ul></li><li><span><a href="#siN-EMBARGO.....-🚨º" data-toc-modified-id="siN-EMBARGO.....-🚨º-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>siN EMBARGO..... 🚨º</a></span><ul class="toc-item"><li><span><a href="#Obtener-los-valores-únicos-de-una-columna-(es-decir,-una-serie)" data-toc-modified-id="Obtener-los-valores-únicos-de-una-columna-(es-decir,-una-serie)-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Obtener los valores únicos de una columna (es decir, una serie)</a></span></li><li><span><a href="#Cambiar-el-tipo-de-datos-de-una-columna" data-toc-modified-id="Cambiar-el-tipo-de-datos-de-una-columna-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Cambiar el tipo de datos de una columna</a></span></li><li><span><a href="#Filtramos-los-datos-por-el-valor-de-las-columnas" data-toc-modified-id="Filtramos-los-datos-por-el-valor-de-las-columnas-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>Filtramos los datos por el valor de las columnas</a></span></li><li><span><a href="#Copia-de-un-dataframe-y-renombrar-columnas" data-toc-modified-id="Copia-de-un-dataframe-y-renombrar-columnas-7.4"><span class="toc-item-num">7.4&nbsp;&nbsp;</span>Copia de un dataframe y renombrar columnas</a></span><ul class="toc-item"><li><span><a href="#Renombramos-columnas" data-toc-modified-id="Renombramos-columnas-7.4.1"><span class="toc-item-num">7.4.1&nbsp;&nbsp;</span>Renombramos columnas</a></span></li><li><span><a href="#Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-¿os-suena-esto?" data-toc-modified-id="Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-¿os-suena-esto?-7.4.2"><span class="toc-item-num">7.4.2&nbsp;&nbsp;</span>Podemos renombrar las columnas machacando el atributo de la instancia... ¿os suena esto?</a></span></li></ul></li><li><span><a href="#Borramos-columnas" data-toc-modified-id="Borramos-columnas-7.5"><span class="toc-item-num">7.5&nbsp;&nbsp;</span>Borramos columnas</a></span></li><li><span><a href="#Borramos-filas" data-toc-modified-id="Borramos-filas-7.6"><span class="toc-item-num">7.6&nbsp;&nbsp;</span>Borramos filas</a></span></li><li><span><a href="#Reset_index-y-set_index" data-toc-modified-id="Reset_index-y-set_index-7.7"><span class="toc-item-num">7.7&nbsp;&nbsp;</span>Reset_index y set_index</a></span><ul class="toc-item"><li><span><a href="#SET_INDEX" data-toc-modified-id="SET_INDEX-7.7.1"><span class="toc-item-num">7.7.1&nbsp;&nbsp;</span>SET_INDEX</a></span></li></ul></li><li><span><a href="#Operaciones-entre-columnas" data-toc-modified-id="Operaciones-entre-columnas-7.8"><span class="toc-item-num">7.8&nbsp;&nbsp;</span>Operaciones entre columnas</a></span></li></ul></li><li><span><a href="#Apply-!!" data-toc-modified-id="Apply-!!-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Apply !!</a></span></li><li><span><a href="#Df-.loc-e-.iloc" data-toc-modified-id="Df-.loc-e-.iloc-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Df .loc e .iloc</a></span><ul class="toc-item"><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-mediante-posición-con-iloc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-mediante-posición-con-iloc-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas mediante posición con iloc</a></span></li><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas en base a etiquetas con loc</a></span><ul class="toc-item"><li><span><a href="#En-base-a-etiqueta" data-toc-modified-id="En-base-a-etiqueta-9.2.1"><span class="toc-item-num">9.2.1&nbsp;&nbsp;</span>En base a etiqueta</a></span></li></ul></li></ul></li><li><span><a href="#Ordenamos-un-dataframe" data-toc-modified-id="Ordenamos-un-dataframe-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Ordenamos un dataframe</a></span><ul class="toc-item"><li><span><a href="#Buscamos-valores-nulos" data-toc-modified-id="Buscamos-valores-nulos-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>Buscamos valores nulos</a></span><ul class="toc-item"><li><span><a href="#¿Es-nulo?" data-toc-modified-id="¿Es-nulo?-10.1.1"><span class="toc-item-num">10.1.1&nbsp;&nbsp;</span>¿Es nulo?</a></span></li><li><span><a href="#¿Es-NO-nulo?" data-toc-modified-id="¿Es-NO-nulo?-10.1.2"><span class="toc-item-num">10.1.2&nbsp;&nbsp;</span>¿Es NO nulo?</a></span></li><li><span><a href="#Sacar-una-suma-de-los-valores-nulos-de-cada-columna" data-toc-modified-id="Sacar-una-suma-de-los-valores-nulos-de-cada-columna-10.1.3"><span class="toc-item-num">10.1.3&nbsp;&nbsp;</span>Sacar una suma de los valores nulos de cada columna</a></span></li></ul></li><li><span><a href="#Borramos-los-valores-nulos" data-toc-modified-id="Borramos-los-valores-nulos-10.2"><span class="toc-item-num">10.2&nbsp;&nbsp;</span>Borramos los valores nulos</a></span></li><li><span><a href="#Cómo-rellenar-los-datos-que-faltan" data-toc-modified-id="Cómo-rellenar-los-datos-que-faltan-10.3"><span class="toc-item-num">10.3&nbsp;&nbsp;</span>Cómo rellenar los datos que faltan</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#CATEGÓRICAS-EN-DATAFRAME-Y-DEJAR-DOCUMENTACIÓN" data-toc-modified-id="CATEGÓRICAS-EN-DATAFRAME-Y-DEJAR-DOCUMENTACIÓN-10.3.0.1"><span class="toc-item-num">10.3.0.1&nbsp;&nbsp;</span>CATEGÓRICAS EN DATAFRAME Y DEJAR DOCUMENTACIÓN</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Borramos-los-duplicados" data-toc-modified-id="Borramos-los-duplicados-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Borramos los duplicados</a></span></li><li><span><a href="#Agregación-de-datos" data-toc-modified-id="Agregación-de-datos-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Agregación de datos</a></span><ul class="toc-item"><li><span><a href="#GroupBy" data-toc-modified-id="GroupBy-12.1"><span class="toc-item-num">12.1&nbsp;&nbsp;</span>GroupBy</a></span><ul class="toc-item"><li><span><a href="#Me-preguntaréis-¿y-si-quiero-agrupar-por-más-columnas?" data-toc-modified-id="Me-preguntaréis-¿y-si-quiero-agrupar-por-más-columnas?-12.1.1"><span class="toc-item-num">12.1.1&nbsp;&nbsp;</span>Me preguntaréis ¿y si quiero agrupar por más columnas?</a></span></li></ul></li><li><span><a href="#Unión-de-Dataframes" data-toc-modified-id="Unión-de-Dataframes-12.2"><span class="toc-item-num">12.2&nbsp;&nbsp;</span>Unión de Dataframes</a></span></li><li><span><a href="#Concat" data-toc-modified-id="Concat-12.3"><span class="toc-item-num">12.3&nbsp;&nbsp;</span>Concat</a></span></li><li><span><a href="#Merge" data-toc-modified-id="Merge-12.4"><span class="toc-item-num">12.4&nbsp;&nbsp;</span>Merge</a></span></li><li><span><a href="#Join" data-toc-modified-id="Join-12.5"><span class="toc-item-num">12.5&nbsp;&nbsp;</span>Join</a></span></li></ul></li><li><span><a href="#Exportar-datos" data-toc-modified-id="Exportar-datos-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Exportar datos</a></span></li><li><span><a href="#Métodos-habituales-de-pandas" data-toc-modified-id="Métodos-habituales-de-pandas-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Métodos habituales de pandas</a></span></li><li><span><a href="#Resumen" data-toc-modified-id="Resumen-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Resumen</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-16"><span class="toc-item-num">16&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

# Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

Mi gif favorito para la que, a partir de ahora, será tu librería favorita 😍

## Introducción 
Pandas es, sin duda, la biblioteca más utilizada en el ecosistema de Python para el análisis y la manipulación de datos. Es rápida, potente, flexible, fácil de usar y de código abierto. 


Entre sus principales características están
* Un objeto **DataFrame** rápido y eficiente para la manipulación de datos con indexación integrada
* **Lectura y escritura** de datos en multitud de formatos: Microsoflt Excel, CSV, bases de datos SQL, JSON, diccionarios, etc;
* Métodos integrados y eficientes para todo tipo de manipulación de datos: datos faltantes, subconjunto, unión, fusión, etc; 
* Facilidad para trabajar con datos temporales (de hecho, Pandas se llama así por "PANnel DAta") 
* Buena **integración con otras librerías** de análisis de datos o Machine learning: scikit-learn, scipy, seaborn, plotly, etc;
* Es **ampliamente utilizado** tanto en el sector privado como en el académico     


Pandas proporciona estructuras de datos de alto nivel y funciones diseñadas para hacer que el trabajo con datos estructurados o tabulares sea rápido, fácil y expresivo. Desde su aparición en 2010, ha ayudado a que Python sea un entorno de análisis de datos potente y productivo. Los principales objetos de pandas que se utilizarán en este libro son el DataFrame, una estructura de datos tabular orientada a columnas con etiquetas de filas y columnas, y la Serie, un objeto de matriz unidimensional etiquetado.

Pandas combina las ideas de alto rendimiento de NumPy con las capacidades flexibles de manipulación de datos de las hojas de cálculo y las bases de datos relacionales (como SQL). Proporciona una sofisticada funcionalidad de indexación para facilitar la remodelación, el corte y la división, la realización de agregaciones y la selección de subconjuntos de datos.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Fuente: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

##  Instalación

Lo primerito que deberás hacer, siempre será     
pip install pandas / conda install pandas

In [2]:
#%conda install pandas
import pandas as pd

## Introducción a las estructuras de datos de pandas
Para empezar con pandas, necesitarás sentirte cómodo con sus dos estructuras de datos de trabajo: Series y DataFrame. Aunque no son una solución universal para todos los problemas, proporcionan una base sólida y fácil de usar para la mayoría de las aplicaciones.

### Series
Una Serie es un objeto tipo array unidimensional que contiene una secuencia de valores y un array asociado de etiquetas de datos, llamado su índice. La Serie más sencilla se forma a partir de un único array de datos:

In [3]:
serie = pd.Series(["hola",1,23,4, [1,2,3],"otro string"])

In [4]:
serie

0           hola
1              1
2             23
3              4
4      [1, 2, 3]
5    otro string
dtype: object

In [5]:
type(serie)

pandas.core.series.Series

In [6]:
serie.values

array(['hola', 1, 23, 4, list([1, 2, 3]), 'otro string'], dtype=object)

In [7]:
serie.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
list(serie.values)

['hola', 1, 23, 4, [1, 2, 3], 'otro string']

In [9]:
list(serie.index)

[0, 1, 2, 3, 4, 5]

La representación en cadena de una Serie mostrada interactivamente muestra el índice a la izquierda y los valores a la derecha. Como no especificamos un índice para los datos, se crea uno por defecto formado por los enteros 0 a N - 1 (donde N es la longitud de los datos). Puedes obtener la representación del array y el objeto índice de la Serie a través de sus atributos values e index, respectivamente:

In [10]:
serie.values

array(['hola', 1, 23, 4, list([1, 2, 3]), 'otro string'], dtype=object)

In [11]:
serie.index

RangeIndex(start=0, stop=6, step=1)

Otra forma de pensar en una Serie es como un diccionario ordenado de longitud fija, ya que es un mapeo de valores de índice a valores de datos. Se puede utilizar en muchos contextos en los que se podría utilizar un diccionario.
Si tienes datos contenidos en un dict de Python, puedes crear una Serie a partir de ellos pasando el dict:

In [12]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [13]:
seriedata = pd.Series(sdata)

In [14]:
seriedata

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
list(seriedata.index)

['Ohio', 'Texas', 'Oregon', 'Utah']

In [16]:
list(seriedata.values)

[35000, 71000, 16000, 5000]

In [17]:
display(seriedata)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Cuando sólo se pasa un dict, el índice de la Serie resultante tendrá las claves del dict en orden. Puedes modificar el comportamientopasando las claves del dict en el orden que desee que aparezcan en la Serie resultante:

In [18]:
estados = ['California', 'Ohio', 'Oregon', 'Texas']

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
serie2 = pd.Series(sdata, index=estados)

In [21]:
serie2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Aquí, los tres valores encontrados en sdata se colocaron en los lugares apropiados, pero como no se encontró ningún valor para 'California', aparece como NaN (Not a Number / no es un número), lo que se considera en pandas para marcar valores perdidos o NA. Como "Utah" no se incluyó en los estados, se excluye del objeto resultante.

In [22]:
#%conda install numpy
import numpy as np

In [23]:
print(np.nan)

nan

In [24]:
type(np.nan)

float

In [25]:
"NaN"

'NaN'

In [26]:
a = np.nan
a

nan

In [27]:
if np.isnan(a):
    print("Hola")

Hola

In [28]:
# No no puedo comprobar si a es un nan así 
a == np.nan

False

### Buscar valores NaN
NaN significa Not A Number (No es un número) y es una de las formas habituales de representar el valor que falta en los datos. Es un valor especial de punto flotante y no puede ser convertido a otro tipo que no sea float.
El valor NaN es uno de los principales problemas en el análisis de datos. Es muy esencial tratar con NaN para obtener los resultados deseados.

In [29]:
# El método de pandas para buscar NaN es pd.isnull
pd.isnull(serie2)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
pd.isnull(serie2).sum()

1

In [31]:
pd.isna(serie2)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [32]:
pd.isna(serie2).sum()

1

[Isna vs isnull](https://datascience.stackexchange.com/questions/37878/difference-between-isna-and-isnull-in-pandas)

🙃🚀---> Nos hemos quedado aquí <--- 🚀🙃

## Datos de lectura/escritura

Pandas puede leer y escribir datos de una gran variedad de formatos. [Lee la documentación](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Aunque una de las más comunes es a partir de un diccionario de listas de igual longitud o arrays NumPy:

In [33]:
# Desde un diccionario
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, np.nan]}

In [34]:
frame = pd.DataFrame(data)

In [35]:
display(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

In [36]:
frame['pop'].mean()

2.4200000000000004

In [37]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [38]:
# Para visualizar un dataframe utilizaremos display y NO print
print(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

In [39]:
display(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

In [40]:
lista = [1.5, 1.7, 3.6, 2.4, 2.9] #Los NaN no entran en el cálculo, los omite

In [41]:
sum(lista)/len(lista)

2.4200000000000004

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.from_dict.html

In [42]:
pd.DataFrame.from_dict(data, orient="columns") # orient="index"

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

In [43]:
pd.DataFrame.from_dict(data, orient="index") # orient="index"

          0     1     2       3       4       5
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
year   2000  2001  2002    2001    2002    2003
pop     1.5   1.7   3.6     2.4     2.9     NaN

In [44]:
import pandas as pd
import numpy as np

In [45]:
# Desde una lista de diccionarios
datos = [{'nombre': 'Victor',
               'apellido': 'Pablo',
               'email': 'victor.pablo@gamma.com',
               'vacaciones': 10,
               'saludo': lambda: print('Hacedme la Pull Request!!!!')} ,
         
         {'nombre': 'Javier',
               'apellido': 'García',
                  'email': 'javi.garcia@gamma.com',
               'vacaciones': 15,
               'saludo': lambda : print('Hola soy Javi, cuidado con los print infinitos') },
        {'nombre': 'Pablo',
               'apellido': 'Martinez',
                  'email': 'pablo.martinez@gamma.com',
               'vacaciones': np.nan,
               'saludo': lambda: print('Hola, soy Pablo y no tengo vacaciones definidas') }]

In [46]:
datos[0]["saludo"]()

Hacedme la Pull Request!!!!

In [47]:
df_datos = pd.DataFrame(datos)

In [48]:
display(df_datos)

,nombre,apellido,email,vacaciones,saludo
0,Victor,Pablo,victor.pablo@gamma.com,10.0,<function <lambda> at 0x7f9b94c5a550>
1,Javier,García,javi.garcia@gamma.com,15.0,<function <lambda> at 0x7f9b94c5a5e0>
2,Pablo,Martinez,pablo.martinez@gamma.com,NaN,<function <lambda> at 0x7f9b94c5a820>

Si hago un dataframe a través de una lista de diccionarios:       
    - Cada diccionario será una fila   
    - Las keys serán los nombres de las columnas    
    - Tienen que tener la misma estructura

Como estamos usando Jupyter Notebook, los objetos DataFrame de pandas se mostrarán como una tabla HTML más amigable para el navegador.

### Cargamos datos de formato CSV

In [49]:
df = pd.read_csv("datasets/avocado_kaggle.csv") # MI VARIABLE SE LLAMA DF

In [50]:
display(df)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [51]:
df.shape

(18249, 14)

In [52]:
df.shape[0] #Filas

18249

In [53]:
df.shape[1] #Columnas

14

### Cargamos datos de formato xlsx

In [54]:
#%conda install openpyxl

In [55]:
import openpyxl

In [56]:
retail = pd.read_excel("datasets/Online Retail.xlsx")

In [57]:
retail.shape

(396034, 9)

### Visualizamos las primeras filas

In [58]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

Por defecto head me muestra las 5 primeras filas, puedo ver algunas más o algunas menos pasándole un número como parámetro

In [59]:
df.head(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany

### Visualizamos las últimas filas

In [60]:
df.tail()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

Excatamente igual que con .head() le pasamos un parámetro a .tail()

In [61]:
df.tail(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

### Visualizamos una muestra aleatoria

In [62]:
df.sample() #si no le pasamos un parámetro, visualiza una sola fila de forma aleatoria.

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12790,25,2016-07-03,1.81,7342.95,290.67,289.24,308.49,6454.55,5908.2,546.35,0.0,organic,2016,HarrisburgScranton

In [63]:
# Muestra aleatoria de 5 filas
df.sample(5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
1721,5,2015-11-22,0.77,737834.48,441712.62,220374.84,11102.75,64644.27,63088.81,1555.46,0.0,conventional,2015,PhoenixTucson
7030,36,2017-04-23,1.10,226088.30,109053.98,8877.76,75.09,108081.47,97879.10,8397.37,1805.0,conventional,2017,Nashville
2650,50,2015-01-11,1.24,235231.08,142237.71,36017.93,56.25,56919.19,19605.39,37313.80,0.0,conventional,2015,Tampa
3218,46,2016-02-07,0.80,325941.39,63128.71,160544.54,42056.68,60211.46,42529.78,17681.68,0.0,conventional,2016,Charlotte
16077,11,2017-10-15,1.84,174355.00,2928.11,35554.07,556.45,135316.37,127686.14,7630.23,0.0,organic,2017,Midsouth

In [64]:
df.sample(frac=0.1) # Muestra aleatoria del 10%

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9460,22,2015-07-26,1.93,98449.84,31604.24,57990.08,0.00,8855.52,8855.52,0.00,0.00,organic,2015,California
2344,4,2015-11-29,0.82,3969578.89,2105670.46,1234911.39,27985.18,601011.86,505843.61,95136.58,31.67,conventional,2015,SouthCentral
17564,14,2017-09-24,2.26,9528.64,1545.34,2234.23,0.00,5749.07,5722.40,26.67,0.00,organic,2017,WestTexNewMexico
16350,19,2017-08-20,1.68,17812.78,11.35,258.45,0.00,17542.98,17542.98,0.00,0.00,organic,2017,NorthernNewEngland
7016,22,2017-07-30,1.14,217774.89,106460.13,29771.49,52.14,81491.13,65555.61,14827.94,1107.58,conventional,2017,Nashville
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13300,15,2016-09-11,0.93,14786.96,553.66,3278.67,0.00,10954.63,2812.11,8142.52,0.00,organic,2016,Nashville
17497,0,2017-12-31,1.48,229477.07,26883.07,53165.30,86.61,149342.09,66254.72,82977.60,109.77,organic,2017,West
12859,42,2016-03-06,2.18,6367.65,657.42,3388.23,0.00,2322.00,2313.06,8.94,0.00,organic,2016,HartfordSpringfield
16846,38,2017-04-09,0.89,15201.67,382.49,2930.05,0.00,11889.13,2331.66,9557.47,0.00,organic,2017,Roanoke
12274,29,2016-06-05,1.55,182778.37,26377.62,88667.93,7.66,67725.16,67138.56,586.60,0.00,organic,2016,California

In [65]:
#pd.set_option('display.max_rows', 20)

In [66]:
guardo_sample = df.sample(frac=0.1)

In [67]:
guardo_sample.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
17222,43,2017-03-05,1.11,95526.15,13231.55,12552.42,275.95,69466.23,12241.84,57224.39,0.00,organic,2017,Southeast
6227,28,2017-06-18,0.90,1441940.59,734956.89,307811.08,4290.60,394882.02,391342.54,3444.02,95.46,conventional,2017,DallasFtWorth
1645,33,2015-05-10,1.23,257032.99,185586.20,19590.84,138.92,51717.03,35990.16,15726.87,0.00,conventional,2015,Orlando
16581,38,2017-04-09,1.51,9893.97,923.93,5.47,0.00,8964.57,8364.69,599.88,0.00,organic,2017,Pittsburgh
3342,14,2016-09-18,1.07,167438.32,85331.98,26634.72,2505.47,52966.15,51334.31,1631.84,0.00,conventional,2016,Columbus

In [68]:
guardo_sample.shape

(1825, 14)

## Análisis exploratorio de un dataframe

In [69]:
df.shape

(18249, 14)

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [71]:
df.isnull().sum()

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

In [72]:
df.describe() #Solo lo hace con columnas que tienen datos de tipo numerio

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
count,18249.000000,18249.000000,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,18249.000000,18249.000000
mean,24.232232,1.405978,8.506440e+05,2.930084e+05,2.951546e+05,2.283974e+04,2.396392e+05,1.821947e+05,5.433809e+04,3106.426507,2016.147899
std,15.481045,0.402677,3.453545e+06,1.264989e+06,1.204120e+06,1.074641e+05,9.862424e+05,7.461785e+05,2.439660e+05,17692.894652,0.939938
min,0.000000,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000
25%,10.000000,1.100000,1.083858e+04,8.540700e+02,3.008780e+03,0.000000e+00,5.088640e+03,2.849420e+03,1.274700e+02,0.000000,2015.000000
50%,24.000000,1.370000,1.073768e+05,8.645300e+03,2.906102e+04,1.849900e+02,3.974383e+04,2.636282e+04,2.647710e+03,0.000000,2016.000000
75%,38.000000,1.660000,4.329623e+05,1.110202e+05,1.502069e+05,6.243420e+03,1.107834e+05,8.333767e+04,2.202925e+04,132.500000,2017.000000
max,52.000000,3.250000,6.250565e+07,2.274362e+07,2.047057e+07,2.546439e+06,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000

In [73]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,18249.0,24.232232,1.548104e+01,0.00,10.00,24.00,38.00,52.00
AveragePrice,18249.0,1.405978,4.026766e-01,0.44,1.10,1.37,1.66,3.25
Total Volume,18249.0,850644.013009,3.453545e+06,84.56,10838.58,107376.76,432962.29,62505646.52
4046,18249.0,293008.424531,1.264989e+06,0.00,854.07,8645.30,111020.20,22743616.17
4225,18249.0,295154.568356,1.204120e+06,0.00,3008.78,29061.02,150206.86,20470572.61
4770,18249.0,22839.735993,1.074641e+05,0.00,0.00,184.99,6243.42,2546439.11
Total Bags,18249.0,239639.202060,9.862424e+05,0.00,5088.64,39743.83,110783.37,19373134.37
Small Bags,18249.0,182194.686696,7.461785e+05,0.00,2849.42,26362.82,83337.67,13384586.80
Large Bags,18249.0,54338.088145,2.439660e+05,0.00,127.47,2647.71,22029.25,5719096.61
XLarge Bags,18249.0,3106.426507,1.769289e+04,0.00,0.00,0.00,132.50,551693.65
year,18249.0,2016.147899,9.399385e-01,2015.00,2015.00,2016.00,2017.00,2018.00

In [74]:
type(df.describe())

pandas.core.frame.DataFrame

In [75]:
df.mean(numeric_only=True) # numeric_only=True

Unnamed: 0          24.232232
AveragePrice         1.405978
Total Volume    850644.013009
4046            293008.424531
4225            295154.568356
4770             22839.735993
Total Bags      239639.202060
Small Bags      182194.686696
Large Bags       54338.088145
XLarge Bags       3106.426507
year              2016.147899
dtype: float64

In [76]:
df.AveragePrice.mean()

1.405978409775878

In [77]:
df["Total Volume"].mean()

850644.0130089321

In [78]:
df["Total Volume"].min()

84.56

In [79]:
df["Total Volume"].max()

62505646.52

In [80]:
df["Total Volume"].std()

3453545.3553994712

In [81]:
df.type.value_counts()

type
conventional    9126
organic         9123
Name: count, dtype: int64

In [82]:
df.year.value_counts()

year
2017    5722
2016    5616
2015    5615
2018    1296
Name: count, dtype: int64

In [83]:
df.region.value_counts()

region
Albany                 338
Sacramento             338
Northeast              338
NorthernNewEngland     338
Orlando                338
Philadelphia           338
PhoenixTucson          338
Pittsburgh             338
Plains                 338
Portland               338
RaleighGreensboro      338
RichmondNorfolk        338
Roanoke                338
SanDiego               338
Atlanta                338
SanFrancisco           338
Seattle                338
SouthCarolina          338
SouthCentral           338
Southeast              338
Spokane                338
StLouis                338
Syracuse               338
Tampa                  338
TotalUS                338
West                   338
NewYork                338
NewOrleansMobile       338
Nashville              338
Midsouth               338
BaltimoreWashington    338
Boise                  338
Boston                 338
BuffaloRochester       338
California             338
Charlotte              338
Chicago                338
CincinnatiDayton       338
Columbus               338
DallasFtWorth          338
Denver                 338
Detroit                338
GrandRapids            338
GreatLakes             338
HarrisburgScranton     338
HartfordSpringfield    338
Houston                338
Indianapolis           338
Jacksonville           338
LasVegas               338
LosAngeles             338
Louisville             338
MiamiFtLauderdale      338
WestTexNewMexico       335
Name: count, dtype: int64

In [84]:
df.region.value_counts()

region
Albany                 338
Sacramento             338
Northeast              338
NorthernNewEngland     338
Orlando                338
Philadelphia           338
PhoenixTucson          338
Pittsburgh             338
Plains                 338
Portland               338
RaleighGreensboro      338
RichmondNorfolk        338
Roanoke                338
SanDiego               338
Atlanta                338
SanFrancisco           338
Seattle                338
SouthCarolina          338
SouthCentral           338
Southeast              338
Spokane                338
StLouis                338
Syracuse               338
Tampa                  338
TotalUS                338
West                   338
NewYork                338
NewOrleansMobile       338
Nashville              338
Midsouth               338
BaltimoreWashington    338
Boise                  338
Boston                 338
BuffaloRochester       338
California             338
Charlotte              338
Chicago                338
CincinnatiDayton       338
Columbus               338
DallasFtWorth          338
Denver                 338
Detroit                338
GrandRapids            338
GreatLakes             338
HarrisburgScranton     338
HartfordSpringfield    338
Houston                338
Indianapolis           338
Jacksonville           338
LasVegas               338
LosAngeles             338
Louisville             338
MiamiFtLauderdale      338
WestTexNewMexico       335
Name: count, dtype: int64

In [85]:
#df["Large Bags"].value_counts()

In [86]:
# Seleccionamos las columnas cuyo tipo de dato es int64
columnas_numericas = df._get_numeric_data()

In [87]:
columnas_numericas

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
0,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,2015
1,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,2015
2,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,2015
3,3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,2015
4,4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,2015
...,...,...,...,...,...,...,...,...,...,...,...
18244,7,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,2018
18245,8,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,2018
18246,9,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,2018
18247,10,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,2018
18248,11,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,2018

In [88]:
df.dtypes #tipo de dato que contiene cada columna

Unnamed: 0        int64
Date             object
AveragePrice    float64
Total Volume    float64
4046            float64
4225            float64
4770            float64
Total Bags      float64
Small Bags      float64
Large Bags      float64
XLarge Bags     float64
type             object
year              int64
region           object
dtype: object

In [89]:
# Podemos incluir y excluir
df.select_dtypes(include="object").head()

         Date          type  region
0  2015-12-27  conventional  Albany
1  2015-12-20  conventional  Albany
2  2015-12-13  conventional  Albany
3  2015-12-06  conventional  Albany
4  2015-11-29  conventional  Albany

In [90]:
df.select_dtypes( include="float").head()

,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags
0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0
1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0
2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0
3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0
4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0

In [91]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
4476,4,2016-11-27,1.57,279131.45,10693.47,180338.49,859.82,87239.67,82183.54,5056.13,0.0,conventional,2016,Philadelphia

## Operaciones básicas con los dataframes

### Seleccionamos una columna

In [92]:
df.columns #Podemos ver las columnas del df

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [93]:
df.columns.tolist() #Sacar listado de las columnas del df

['Unnamed: 0',
 'Date',
 'AveragePrice',
 'Total Volume',
 '4046',
 '4225',
 '4770',
 'Total Bags',
 'Small Bags',
 'Large Bags',
 'XLarge Bags',
 'type',
 'year',
 'region']

In [94]:
# Tengo una serie de pandas
unacolumna = df["Total Bags"]
unacolumna

0         8696.87
1         9505.56
2         8145.35
3         5811.16
4         6183.95
           ...
18244    13498.67
18245     9264.84
18246     9394.11
18247    10969.54
18248    12014.15
Name: Total Bags, Length: 18249, dtype: float64

In [95]:
# Si solo pongo unos corchetes, tengo una serie de pandas
unacolumna_dataframe = df[["Total Bags"]]
unacolumna_dataframe.head()

   Total Bags
0     8696.87
1     9505.56
2     8145.35
3     5811.16
4     6183.95

In [96]:
# Si a pesar de pasarle una lista, solo tiene un elemento, tengo un dataframe con una sola columna

In [97]:
# O dos :), o las que queramos

### Seleccionamos varias columnas

In [98]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [99]:
df2 = df[["Total Bags", "AveragePrice", "region"]]

In [100]:
df2.sample(10)

      Total Bags  AveragePrice               region
928     73550.85          1.38  HartfordSpringfield
5157  1397084.84          1.09         SouthCentral
7390   534479.18          0.75        PhoenixTucson
1567    33770.89          0.96   NorthernNewEngland
4        6183.95          1.28               Albany
8246    30706.59          1.66             Syracuse
5651    22819.87          1.13               Albany
4233    73192.73          1.20     NewOrleansMobile
1756    60883.78          0.71        PhoenixTucson
4797    51228.61          1.27      RichmondNorfolk

In [101]:
#le podemos pasar directamente una lista con los nombres de las columnas
lista_columnas = ['Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags']

In [102]:
df_nuevo = df[lista_columnas]

In [103]:
df_nuevo.sample()

      Total Bags  Small Bags  Large Bags  XLarge Bags
1462   225327.84   196060.17    29267.67          0.0

In [104]:
# Listar los nombres de columnas de un dataframe
columnas = list(df.columns)
columnas

['Unnamed: 0',
 'Date',
 'AveragePrice',
 'Total Volume',
 '4046',
 '4225',
 '4770',
 'Total Bags',
 'Small Bags',
 'Large Bags',
 'XLarge Bags',
 'type',
 'year',
 'region']

In [105]:
copia = df.copy() # Hacemos una copia

In [106]:
copia.drop(columns="AveragePrice", inplace=True) #Por defecto inplace = False
copia.columns

Index(['Unnamed: 0', 'Date', 'Total Volume', '4046', '4225', '4770',
       'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year',
       'region'],
      dtype='object')

In [107]:
df.head(1) # Las modificaciones que hago en la copia son independientes del original y no afectan

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany

In [108]:
copia is df# PORQUE COPIA NO ES DF

False

## 🚨🚨🚨 OJO CUIDADO!!🚨🚨🚨🚨

In [109]:
copia2 = df # si igualo la variable sin hacer copy me cargo el original

In [110]:
copia2.drop(columns="Total Bags", inplace=True)

In [111]:
copia2 is df # PORQUE COPIA2 SÍ ES DFdf.

True

In [112]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,5986.26,197.69,0.0,conventional,2015,Albany

### Obtener los valores únicos de una columna (es decir, una serie)

In [113]:
df.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [114]:
list(df.region.unique())

['Albany',
 'Atlanta',
 'BaltimoreWashington',
 'Boise',
 'Boston',
 'BuffaloRochester',
 'California',
 'Charlotte',
 'Chicago',
 'CincinnatiDayton',
 'Columbus',
 'DallasFtWorth',
 'Denver',
 'Detroit',
 'GrandRapids',
 'GreatLakes',
 'HarrisburgScranton',
 'HartfordSpringfield',
 'Houston',
 'Indianapolis',
 'Jacksonville',
 'LasVegas',
 'LosAngeles',
 'Louisville',
 'MiamiFtLauderdale',
 'Midsouth',
 'Nashville',
 'NewOrleansMobile',
 'NewYork',
 'Northeast',
 'NorthernNewEngland',
 'Orlando',
 'Philadelphia',
 'PhoenixTucson',
 'Pittsburgh',
 'Plains',
 'Portland',
 'RaleighGreensboro',
 'RichmondNorfolk',
 'Roanoke',
 'Sacramento',
 'SanDiego',
 'SanFrancisco',
 'Seattle',
 'SouthCarolina',
 'SouthCentral',
 'Southeast',
 'Spokane',
 'StLouis',
 'Syracuse',
 'Tampa',
 'TotalUS',
 'West',
 'WestTexNewMexico']

In [115]:
df_datos.nombre.unique()

array(['Victor', 'Javier', 'Pablo'], dtype=object)

### Cambiar el tipo de datos de una columna

In [116]:
df.AveragePrice.dtype

dtype('float64')

In [117]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Small Bags    18249 non-null  float64
 8   Large Bags    18249 non-null  float64
 9   XLarge Bags   18249 non-null  float64
 10  type          18249 non-null  object
 11  year          18249 non-null  int64
 12  region        18249 non-null  object
dtypes: float64(8), int64(2), object(3)
memory usage: 1.8+ MB

In [118]:
df.AveragePrice.head(10)

0    1.33
1    1.35
2    0.93
3    1.08
4    1.28
5    1.26
6    0.99
7    0.98
8    1.02
9    1.07
Name: AveragePrice, dtype: float64

In [119]:
df.AveragePrice.astype(dtype="int8")

0        1
1        1
2        0
3        1
4        1
        ..
18244    1
18245    1
18246    1
18247    1
18248    1
Name: AveragePrice, Length: 18249, dtype: int8

In [120]:
df.AveragePrice.head()

0    1.33
1    1.35
2    0.93
3    1.08
4    1.28
Name: AveragePrice, dtype: float64

In [121]:
# Atención!! que no se cambian los datos si no sobreescribimos la columna
df.AveragePrice = df.AveragePrice.astype(dtype='int8')

In [122]:
df.AveragePrice.head()

0    1
1    1
2    0
3    1
4    1
Name: AveragePrice, dtype: int8

In [123]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  int8
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Small Bags    18249 non-null  float64
 8   Large Bags    18249 non-null  float64
 9   XLarge Bags   18249 non-null  float64
 10  type          18249 non-null  object
 11  year          18249 non-null  int64
 12  region        18249 non-null  object
dtypes: float64(7), int64(2), int8(1), object(3)
memory usage: 1.7+ MB

In [124]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year',
       'region'],
      dtype='object')

In [125]:
df["Large Bags"] = df["Large Bags"].astype(dtype=float) #Puedo crear o reasignar columnas

In [126]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1,64236.62,1036.74,54454.85,48.16,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1,54876.98,674.28,44638.81,58.33,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0,118220.22,794.70,109149.67,130.50,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1,78992.15,1132.00,71976.41,72.58,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1,51039.60,941.48,43838.39,75.78,5986.26,197.69,0.0,conventional,2015,Albany

In [127]:
# Para crear una columna nueva solamente tengo que darle un nombre, por ejemplo df["nueva"]
# Como cuando en un diccionario añado una KEY

In [128]:
df["otra"] = df["Small Bags"] * df["Total Volume"]

In [129]:
df.sample(10)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Small Bags,Large Bags,XLarge Bags,type,year,region,otra
8452,27,2017-06-25,0,1022130.10,565529.68,82613.84,8881.62,150840.39,214264.57,0.00,conventional,2017,WestTexNewMexico,1.541785e+11
16511,21,2017-08-06,1,10737.76,2862.01,2743.00,0.00,5095.53,37.22,0.00,organic,2017,PhoenixTucson,5.471458e+07
2594,46,2015-02-08,1,51557.01,1093.76,26366.48,14.20,23658.13,424.44,0.00,conventional,2015,Syracuse,1.219742e+09
16895,34,2017-05-07,2,5321.75,1861.76,3058.89,0.00,401.10,0.00,0.00,organic,2017,Sacramento,2.134554e+06
12954,33,2016-05-08,1,3820.07,120.00,1964.14,26.94,772.63,936.36,0.00,organic,2016,Indianapolis,2.951501e+06
1949,25,2015-07-05,1,275670.52,42042.96,103086.21,40891.64,88239.15,1410.56,0.00,conventional,2015,RaleighGreensboro,2.432493e+10
6733,4,2017-12-03,1,315521.00,66925.00,127968.00,4488.00,47447.00,68396.00,297.00,conventional,2017,LasVegas,1.497052e+10
11487,21,2015-08-02,1,59918.41,40814.07,6636.20,71.02,12075.30,321.82,0.00,organic,2015,SouthCentral,7.235328e+08
10364,42,2015-03-08,1,1541.79,2.38,912.87,0.00,532.64,93.90,0.00,organic,2015,Louisville,8.212190e+05
5210,10,2016-10-16,1,3233029.42,1219511.41,791521.66,10217.86,420581.32,790113.56,1083.61,conventional,2016,Southeast,1.359752e+12

In [130]:
# No puedo sumar strings y números
df["ejemplo"] = df.AveragePrice * df.region

In [131]:
df[["AveragePrice","region","ejemplo"]].sample(15)

       AveragePrice               region                     ejemplo
9248              1  BaltimoreWashington         BaltimoreWashington
2161              0             SanDiego
1569              1   NorthernNewEngland          NorthernNewEngland
15946             1           LosAngeles                  LosAngeles
12079             1  BaltimoreWashington         BaltimoreWashington
13200             1    MiamiFtLauderdale           MiamiFtLauderdale
13324             1            Nashville                   Nashville
637               0               Denver
6757              1             LasVegas                    LasVegas
7342              1         Philadelphia                Philadelphia
2779              0     WestTexNewMexico
7377              1        PhoenixTucson               PhoenixTucson
17872             1           LosAngeles                  LosAngeles
13995             1              Roanoke                     Roanoke
13669             2        PhoenixTucson  PhoenixTucsonPhoenixTucson

In [132]:
a = "te voy a dar "
b = 2
a*b

'te voy a dar te voy a dar '

### Filtramos los datos por el valor de las columnas

In [133]:
df.region.nunique() #Sacamos el numero de valores unicos

54

In [134]:
len(df.region.unique())

54

In [135]:
df2 = df[df["region"] == "Houston"]

In [136]:
df2.region.value_counts()

region
Houston    338
Name: count, dtype: int64

In [137]:
df2.region.unique()

array(['Houston'], dtype=object)

In [138]:
df2 = df[df["region"] != "Houston"]

In [139]:
df2.sample(4)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Small Bags,Large Bags,XLarge Bags,type,year,region,otra,ejemplo
13475,34,2016-05-01,1,151476.61,8435.32,33077.84,2206.77,95608.27,12148.41,0.00,organic,2016,Northeast,1.448242e+10,Northeast
1824,4,2015-11-29,1,1099646.06,460759.58,364748.79,10648.01,248449.51,14157.64,882.53,conventional,2015,Plains,2.732065e+11,Plains
13414,25,2016-07-03,2,46314.26,4225.62,20280.75,1935.42,19365.45,507.02,0.00,organic,2016,NewYork,8.968965e+08,NewYorkNewYork
4409,41,2016-03-13,1,476634.67,3165.58,382630.54,36964.09,53859.72,14.74,0.00,conventional,2016,NorthernNewEngland,2.567141e+10,NorthernNewEngland

In [140]:
df2.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Indianapolis', 'Jacksonville', 'LasVegas',
       'LosAngeles', 'Louisville', 'MiamiFtLauderdale', 'Midsouth',
       'Nashville', 'NewOrleansMobile', 'NewYork', 'Northeast',
       'NorthernNewEngland', 'Orlando', 'Philadelphia', 'PhoenixTucson',
       'Pittsburgh', 'Plains', 'Portland', 'RaleighGreensboro',
       'RichmondNorfolk', 'Roanoke', 'Sacramento', 'SanDiego',
       'SanFrancisco', 'Seattle', 'SouthCarolina', 'SouthCentral',
       'Southeast', 'Spokane', 'StLouis', 'Syracuse', 'Tampa', 'TotalUS',
       'West', 'WestTexNewMexico'], dtype=object)

In [141]:
#df.info()

In [142]:
# multicondición, & and lógico
multi = df[(df.region == "Houston") & (df.year == 2015)]

Podemos exportar estos df en cualquier momento a varios formatos. Por ejemplo a CSV:

In [143]:
multi.to_csv("datasets/multi_para_Freddy_2.csv") #to_csv lo export a fichero csv y le paso como argumento la ruta y el nombre

In [144]:
df.region.nunique() #No me he cargado ni pisado el df original, estoy creando un df nuevo llamado multi que es una parte filtrada de df

54

In [145]:
multi_p = df[(df.region == "Houston") | (df.region == "Albany")] #OR

In [146]:
multi_p.region.unique()

array(['Albany', 'Houston'], dtype=object)

In [147]:
# | or logico
df[(df.region=="Houston") & (df.AveragePrice >= 0.78) & (df.year != 2017)].head(8)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Small Bags,Large Bags,XLarge Bags,type,year,region,otra,ejemplo
3750,6,2016-11-13,1,828866.80,431731.62,231630.38,4850.40,61276.87,99274.75,102.78,conventional,2016,Houston,5.079036e+10,Houston
3751,7,2016-11-06,1,782911.25,430098.78,168814.95,2921.98,78827.53,102248.01,0.00,conventional,2016,Houston,6.171496e+10,Houston
3752,8,2016-10-30,1,709890.11,346283.28,181578.62,3192.69,47722.65,131112.87,0.00,conventional,2016,Houston,3.387784e+10,Houston
3753,9,2016-10-23,1,777847.84,371566.37,145059.25,2488.59,197398.04,61335.59,0.00,conventional,2016,Houston,1.535456e+11,Houston
10062,0,2015-12-27,1,10598.30,4797.41,57.91,0.00,4815.51,927.47,0.00,organic,2015,Houston,5.103622e+07,Houston
10063,1,2015-12-20,1,9253.24,4463.03,88.26,0.00,3278.23,1423.72,0.00,organic,2015,Houston,3.033425e+07,Houston
10064,2,2015-12-13,1,11494.89,4757.11,93.57,0.00,6636.26,7.95,0.00,organic,2015,Houston,7.628308e+07,Houston
10065,3,2015-12-06,1,8216.98,4787.28,85.70,0.00,3344.00,0.00,0.00,organic,2015,Houston,2.747758e+07,Houston

### Copia de un dataframe y renombrar columnas

In [148]:
otracopia = df.copy()

#### Renombramos columnas
Para renombrar columnas necesitamos un diccionario

In [149]:
columnas #la tenía de antes

['Unnamed: 0',
 'Date',
 'AveragePrice',
 'Total Volume',
 '4046',
 '4225',
 '4770',
 'Total Bags',
 'Small Bags',
 'Large Bags',
 'XLarge Bags',
 'type',
 'year',
 'region']

In [150]:
diccio_nuevas = {columna: columna.replace(" ", "_").lower() for columna in columnas}

In [151]:
diccio_nuevas

{'Unnamed: 0': 'unnamed:_0',
 'Date': 'date',
 'AveragePrice': 'averageprice',
 'Total Volume': 'total_volume',
 '4046': '4046',
 '4225': '4225',
 '4770': '4770',
 'Total Bags': 'total_bags',
 'Small Bags': 'small_bags',
 'Large Bags': 'large_bags',
 'XLarge Bags': 'xlarge_bags',
 'type': 'type',
 'year': 'year',
 'region': 'region'}

In [152]:
diccio_nuevas['AveragePrice'] = 'average_price' #Reasigno el value del diccionario
diccio_nuevas

{'Unnamed: 0': 'unnamed:_0',
 'Date': 'date',
 'AveragePrice': 'average_price',
 'Total Volume': 'total_volume',
 '4046': '4046',
 '4225': '4225',
 '4770': '4770',
 'Total Bags': 'total_bags',
 'Small Bags': 'small_bags',
 'Large Bags': 'large_bags',
 'XLarge Bags': 'xlarge_bags',
 'type': 'type',
 'year': 'year',
 'region': 'region'}

In [153]:
df_renombrado = df.rename(columns=diccio_nuevas)
df_renombrado.sample(5)

,unnamed:_0,date,average_price,total_volume,4046,4225,4770,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
15768,20,2017-08-13,1,8976.09,139.95,1290.13,0.00,5339.72,2183.96,0.00,organic,2017,Indianapolis,4.792981e+07,Indianapolis
3355,27,2016-06-19,1,172220.11,64425.61,36827.16,15000.42,45124.02,6081.41,4761.49,conventional,2016,Columbus,7.771264e+09,Columbus
2365,25,2015-07-05,0,6380287.71,3835278.13,1639735.99,47955.04,754238.62,103046.99,32.94,conventional,2015,SouthCentral,4.812259e+12,
17877,0,2018-03-25,1,4173.70,8.00,988.64,0.00,2031.65,1145.41,0.00,organic,2018,Louisville,8.479498e+06,Louisville
373,9,2015-10-25,1,140920.61,23093.86,38356.83,44882.51,30219.23,4368.18,0.00,conventional,2015,Charlotte,4.258512e+09,Charlotte

In [154]:
# Utilizamos el inplace=True para que se ejecute la acción sobre el dataframe
df.rename(columns=diccio_nuevas, inplace=True)

In [155]:
df.head()

,unnamed:_0,date,average_price,total_volume,4046,4225,4770,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
0,0,2015-12-27,1,64236.62,1036.74,54454.85,48.16,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,1,2015-12-20,1,54876.98,674.28,44638.81,58.33,9408.07,97.49,0.0,conventional,2015,Albany,5.162865e+08,Albany
2,2,2015-12-13,0,118220.22,794.70,109149.67,130.50,8042.21,103.14,0.0,conventional,2015,Albany,9.507518e+08,
3,3,2015-12-06,1,78992.15,1132.00,71976.41,72.58,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
4,4,2015-11-29,1,51039.60,941.48,43838.39,75.78,5986.26,197.69,0.0,conventional,2015,Albany,3.055363e+08,Albany

El método rename me permite renombrar solamente las columnas que yo quiera, las que estén en el diccionario. No hace falta renombrar todas a la vez

In [156]:
otro = {"unnamed:_0": "Inútil","date":"fecha", "columna que no existe ni de broma": "no hace nada"}

In [157]:
df.columns

Index(['unnamed:_0', 'date', 'average_price', 'total_volume', '4046', '4225',
       '4770', 'small_bags', 'large_bags', 'xlarge_bags', 'type', 'year',
       'region', 'otra', 'ejemplo'],
      dtype='object')

In [158]:
df.rename(columns = otro, inplace=True)

In [159]:
df.head()

,Inútil,fecha,average_price,total_volume,4046,4225,4770,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
0,0,2015-12-27,1,64236.62,1036.74,54454.85,48.16,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,1,2015-12-20,1,54876.98,674.28,44638.81,58.33,9408.07,97.49,0.0,conventional,2015,Albany,5.162865e+08,Albany
2,2,2015-12-13,0,118220.22,794.70,109149.67,130.50,8042.21,103.14,0.0,conventional,2015,Albany,9.507518e+08,
3,3,2015-12-06,1,78992.15,1132.00,71976.41,72.58,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
4,4,2015-11-29,1,51039.60,941.48,43838.39,75.78,5986.26,197.69,0.0,conventional,2015,Albany,3.055363e+08,Albany

In [160]:
df.drop(columns="Inútil", inplace=True)

In [161]:
df.head()

,fecha,average_price,total_volume,4046,4225,4770,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
0,2015-12-27,1,64236.62,1036.74,54454.85,48.16,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,2015-12-20,1,54876.98,674.28,44638.81,58.33,9408.07,97.49,0.0,conventional,2015,Albany,5.162865e+08,Albany
2,2015-12-13,0,118220.22,794.70,109149.67,130.50,8042.21,103.14,0.0,conventional,2015,Albany,9.507518e+08,
3,2015-12-06,1,78992.15,1132.00,71976.41,72.58,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
4,2015-11-29,1,51039.60,941.48,43838.39,75.78,5986.26,197.69,0.0,conventional,2015,Albany,3.055363e+08,Albany

#### Podemos renombrar las columnas machacando el atributo de la instancia... ¿os suena esto?
Requiere una lista con el mismo número de columnas

In [162]:
# O podríamos machacar el atributo del objeto columns
df3 = df.copy()

In [163]:
df3.columns

Index(['fecha', 'average_price', 'total_volume', '4046', '4225', '4770',
       'small_bags', 'large_bags', 'xlarge_bags', 'type', 'year', 'region',
       'otra', 'ejemplo'],
      dtype='object')

Podemos renombrar las columnas no solo desde un diccionario con .rename().
O tambien podemos "pisar" la lista de los nombres de las columnas por una de nuestro gusto

In [164]:
len(df3.columns)

14

In [169]:
prueba = ["🐼"]*14

In [170]:
prueba

['🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼', '🐼']

In [171]:
df3.columns

Index(['fecha', 'average_price', 'total_volume', '4046', '4225', '4770',
       'small_bags', 'large_bags', 'xlarge_bags', 'type', 'year', 'region',
       'otra', 'ejemplo'],
      dtype='object')

In [172]:
df3.columns = prueba

In [173]:
df3.head()

,🐼,🐼,🐼,🐼,🐼,🐼,🐼,🐼,🐼,🐼,🐼,🐼,🐼,🐼
0,2015-12-27,1,64236.62,1036.74,54454.85,48.16,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,2015-12-20,1,54876.98,674.28,44638.81,58.33,9408.07,97.49,0.0,conventional,2015,Albany,5.162865e+08,Albany
2,2015-12-13,0,118220.22,794.70,109149.67,130.50,8042.21,103.14,0.0,conventional,2015,Albany,9.507518e+08,
3,2015-12-06,1,78992.15,1132.00,71976.41,72.58,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
4,2015-11-29,1,51039.60,941.48,43838.39,75.78,5986.26,197.69,0.0,conventional,2015,Albany,3.055363e+08,Albany

### Borramos columnas

In [174]:
df.sample()

,fecha,average_price,total_volume,4046,4225,4770,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
14480,2016-01-03,0,10026.13,1303.08,932.82,5.29,83.92,7701.02,0.0,organic,2016,StLouis,841392.8296,

In [175]:
# Axis 1 siempre columnas
df.drop(["4046","4225","4770"],axis=1,inplace=True)

In [176]:
df.sample()

,fecha,average_price,total_volume,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
15298,2017-06-25,1,6043.34,418.74,3551.65,0.0,organic,2017,Columbus,2.530588e+06,Columbus

### Borramos filas

In [177]:
df.head(5)

,fecha,average_price,total_volume,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
0,2015-12-27,1,64236.62,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,2015-12-20,1,54876.98,9408.07,97.49,0.0,conventional,2015,Albany,5.162865e+08,Albany
2,2015-12-13,0,118220.22,8042.21,103.14,0.0,conventional,2015,Albany,9.507518e+08,
3,2015-12-06,1,78992.15,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
4,2015-11-29,1,51039.60,5986.26,197.69,0.0,conventional,2015,Albany,3.055363e+08,Albany

In [178]:
# Axis 0 siempre filas
df.drop([1,2,4], axis=0, inplace=True)

In [179]:
df.reset_index()

,index,fecha,average_price,total_volume,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
0,0,2015-12-27,1,64236.62,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,3,2015-12-06,1,78992.15,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
2,5,2015-11-22,1,55979.78,6556.47,127.44,0.0,conventional,2015,Albany,3.670297e+08,Albany
3,6,2015-11-15,0,83453.76,8196.81,122.05,0.0,conventional,2015,Albany,6.840546e+08,
4,7,2015-11-08,0,109428.33,6266.85,562.37,0.0,conventional,2015,Albany,6.857709e+08,
...,...,...,...,...,...,...,...,...,...,...,...,...
18241,18244,2018-02-04,1,17074.83,13066.82,431.85,0.0,organic,2018,WestTexNewMexico,2.231137e+08,WestTexNewMexico
18242,18245,2018-01-28,1,13888.04,8940.04,324.80,0.0,organic,2018,WestTexNewMexico,1.241596e+08,WestTexNewMexico
18243,18246,2018-01-21,1,13766.76,9351.80,42.31,0.0,organic,2018,WestTexNewMexico,1.287440e+08,WestTexNewMexico
18244,18247,2018-01-14,1,16205.22,10919.54,50.00,0.0,organic,2018,WestTexNewMexico,1.769535e+08,WestTexNewMexico
18245,18248,2018-01-07,1,17489.58,11988.14,26.01,0.0,organic,2018,WestTexNewMexico,2.096675e+08,WestTexNewMexico

Las filas también se pueden eliminar. Ten en cuenta que los índices no se reinician. El índice se asocia a la fila, no al orden.   
¿Se puede reiniciar el index? Correcto

### Reset_index y set_index

Leemos la [documentación](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) para entender algunos parámetros

In [180]:
df.reset_index() # Me mete lo que era el indice original como nueva columna

,index,fecha,average_price,total_volume,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
0,0,2015-12-27,1,64236.62,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,3,2015-12-06,1,78992.15,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
2,5,2015-11-22,1,55979.78,6556.47,127.44,0.0,conventional,2015,Albany,3.670297e+08,Albany
3,6,2015-11-15,0,83453.76,8196.81,122.05,0.0,conventional,2015,Albany,6.840546e+08,
4,7,2015-11-08,0,109428.33,6266.85,562.37,0.0,conventional,2015,Albany,6.857709e+08,
...,...,...,...,...,...,...,...,...,...,...,...,...
18241,18244,2018-02-04,1,17074.83,13066.82,431.85,0.0,organic,2018,WestTexNewMexico,2.231137e+08,WestTexNewMexico
18242,18245,2018-01-28,1,13888.04,8940.04,324.80,0.0,organic,2018,WestTexNewMexico,1.241596e+08,WestTexNewMexico
18243,18246,2018-01-21,1,13766.76,9351.80,42.31,0.0,organic,2018,WestTexNewMexico,1.287440e+08,WestTexNewMexico
18244,18247,2018-01-14,1,16205.22,10919.54,50.00,0.0,organic,2018,WestTexNewMexico,1.769535e+08,WestTexNewMexico
18245,18248,2018-01-07,1,17489.58,11988.14,26.01,0.0,organic,2018,WestTexNewMexico,2.096675e+08,WestTexNewMexico

In [181]:
df.index #Es la columna nueva de índice

Index([    0,     3,     5,     6,     7,     8,     9,    10,    11,    12,
       ...
       18239, 18240, 18241, 18242, 18243, 18244, 18245, 18246, 18247, 18248],
      dtype='int64', length=18246)

In [182]:
#Drop = True evita que se genere otra columna con el index anterior

In [183]:
df_reset_index = df.reset_index(drop=True)
df_reset_index

,fecha,average_price,total_volume,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
0,2015-12-27,1,64236.62,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
1,2015-12-06,1,78992.15,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
2,2015-11-22,1,55979.78,6556.47,127.44,0.0,conventional,2015,Albany,3.670297e+08,Albany
3,2015-11-15,0,83453.76,8196.81,122.05,0.0,conventional,2015,Albany,6.840546e+08,
4,2015-11-08,0,109428.33,6266.85,562.37,0.0,conventional,2015,Albany,6.857709e+08,
...,...,...,...,...,...,...,...,...,...,...,...
18241,2018-02-04,1,17074.83,13066.82,431.85,0.0,organic,2018,WestTexNewMexico,2.231137e+08,WestTexNewMexico
18242,2018-01-28,1,13888.04,8940.04,324.80,0.0,organic,2018,WestTexNewMexico,1.241596e+08,WestTexNewMexico
18243,2018-01-21,1,13766.76,9351.80,42.31,0.0,organic,2018,WestTexNewMexico,1.287440e+08,WestTexNewMexico
18244,2018-01-14,1,16205.22,10919.54,50.00,0.0,organic,2018,WestTexNewMexico,1.769535e+08,WestTexNewMexico
18245,2018-01-07,1,17489.58,11988.14,26.01,0.0,organic,2018,WestTexNewMexico,2.096675e+08,WestTexNewMexico

#### SET_INDEX

In [184]:
df_date = df.set_index("fecha") #Le digo que colmna pasa a servir de indice en mi df
df_date.head()

,average_price,total_volume,small_bags,large_bags,xlarge_bags,type,year,region,otra,ejemplo
fecha,,,,,,,,,,
2015-12-27,1,64236.62,8603.62,93.25,0.0,conventional,2015,Albany,5.526675e+08,Albany
2015-12-06,1,78992.15,5677.40,133.76,0.0,conventional,2015,Albany,4.484700e+08,Albany
2015-11-22,1,55979.78,6556.47,127.44,0.0,conventional,2015,Albany,3.670297e+08,Albany
2015-11-15,0,83453.76,8196.81,122.05,0.0,conventional,2015,Albany,6.840546e+08,
2015-11-08,0,109428.33,6266.85,562.37,0.0,conventional,2015,Albany,6.857709e+08,

¿Para qué nos puede servir tener la fecha como índice?    
Lo veremos más adelante, para analizar series temporales, pero os avanzo un poco de fantasía

![aquí nos hemos quedado](https://media.tenor.com/ZzhRs6kpGGMAAAAC/you-shall-not-pass-gandalf.gif)

In [185]:
PARON

NameError: name 'PARON' is not defined

In [ ]:
#%conda install seaborn
import seaborn as sns
sns.set_context("poster")
sns.set(rc={'figure.figsize': (20.,6.)})
sns.set_style('whitegrid')

In [ ]:
df_filtro = df_date[df_date.region == "Albany"]
df_filtro.head(2)

In [ ]:
len(list(df_filtro.index))

In [ ]:
len(set(list(df_filtro.index)))

In [ ]:
#prueba = df_filtro.loc[~df_filtro.index.duplicated(), :]

In [ ]:
sns.lineplot(data=prueba, x=prueba.index, y=prueba.small_bags)

In [ ]:
df.index.is_unique

### Operaciones entre columnas

In [ ]:
# Para generar una columna nueva solo tengo que ponerle un nombreS

In [ ]:
df["nueva"] = df.large_bags * df.small_bags
df.head(3)

## Apply !!

Aplica una función a lo largo de un eje del DataFrame.      
[Lee la doc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

In [ ]:
#Creamos una función sencilla que vamos a aplicar

In [ ]:
def euros(x):
    return f"{x}"

In [ ]:
euros(5)

In [ ]:
lista = [135,14.16,164.62,23.15,26.15]

In [ ]:
nuevalista = list(map(euros,lista))
nuevalista

In [ ]:
df.head()

In [ ]:
# Aplicamos la función a una columna y vemos el resultado en la salida

In [ ]:
# Si quiero machacar la columna

In [ ]:
df.averageprice = df.averageprice.apply(euros)

In [ ]:
df.head()

In [ ]:
# Vamos a crear una columna nueva haciendo un apply a otra columna

In [ ]:
df["euros"] = df.total_volume.apply(euros)

In [ ]:
df.head()

In [ ]:
#Hazlo con lambda!!
# Vamos a hacer una columna nueva que junte región y año solamente si en type pone convencional y si no otra cosa

In [ ]:
df["fantasya"] = df.apply(lambda fila: f"{fila['year']}, {fila['region']}" if fila["type"] == "conventional" else "OTRACOSA", axis=1)

In [ ]:
df.sample(1)

In [ ]:
df["prueba"] = df.apply(lambda palabra: "loquesea" if palabra["region"] == "Albany" else palabra["euros"], axis=1)

In [ ]:
df.drop(columns=["lakdhfgklajh","ejemplo", "prueba"], inplace=True)

In [ ]:
df.head()

In [ ]:
# Aplicamos una función que además de x tiene otro argumento.

In [ ]:
def empiezapora(palabra,x):
    if x.lower().startswith("a"):
        return x
    else:
        return palabra

In [ ]:
empiezapora("hola", "gente")

In [ ]:
empiezapora("hola", "jjajajaja")

In [ ]:
df["nosemeocurre"] = df.region.apply(empiezapora("NOEMPIEZAPORA", ¿CÓMO C*** LE DIGO A PANDAS QUE AQUÍ VA CADA REGISTRO)

In [ ]:
# no puedo, tengo que hacerlo con lambda como hemos hecho arriba

Cuando hago un apply sobre una columna, aunque use un lambda, no pongo axis porque en el caso de abajo, lo que estoy haciendo es modificar una columna, utilizo lambda para decirle al apply que el primer argumento es un string que viene de fuera y el segundo argumento es el propio registro del dataframe.

In [ ]:
df["columna_a"] = df.region.apply(lambda registro: (empiezapora("OTRACOSA", registro)))

In [ ]:
df.sample(5)

[Artículo Medium](https://towardsdatascience.com/apply-and-lambda-usage-in-pandas-b13a1ea037f7)     
[Otro Artículo](https://www.geeksforgeeks.org/applying-lambda-functions-to-pandas-dataframe/)      
[La DOCU es tu amiga](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

# Df .loc e .iloc

### Seleccionar filas y columnas en Pandas mediante posición con iloc

El método iloc se utiliza en los DataFrames para seleccionar los elementos en base a su ubicación. Su sintaxis es data.iloc[<filas>, <columnas>], donde <filas> y <columnas> son la posición de las filas y columnas que se desean seleccionar en el orden que aparecen en el objeto. Una notación familiar para los usuarios de Matlab. En un DataFrame cada una de las filas tiene un número que va desde 0 hasta el total de filas menos uno. Siendo iloc el método que permite seleccionar los datos en base a estos números. Lo mismo que aplica a las columnas.

En iloc hay dos argumentos filas y columnas. En caso de que se omita el segundo, se seleccionarán todas las columnas de la fila. Así para seleccionar diferentes filas se puede utilizar.

In [ ]:
#seleccionamos un registro completo
df.iloc[0]

In [ ]:
#un rango de registros con sliding
df.iloc[0:5]

In [ ]:
# Registros de la primera columna
df.iloc[-1:, [0]]

In [ ]:
df.iloc[0:5, [1]]

In [ ]:
# El segundo argumento, en este caso el número 1, es la columna, aquí no pasamos string si no posición.

In [ ]:
df.iloc[0:5, [0,3]]

In [ ]:
# COLUMNAS POR RANGO

In [ ]:
df.iloc[14:24, 3:7]

### Seleccionar filas y columnas en Pandas en base a etiquetas con loc
El método loc se puede usar de dos formas diferentes: seleccionar filas o columnas en base a una etiqueta o seleccionar filas o columnas en base a una condición.

#### En base a etiqueta

In [ ]:
# Loc busca DENTRO del INDEX algo concreto

In [ ]:
df_index_date = df.set_index("date") #Creo un data nuevo para probar en el que el index es la fecha
df_index_date.head(3)

In [ ]:
df_index_date.loc["2015-12-06"].head() # Busco una fecha dentro del index con LOC

In [ ]:
filtrado = df.loc[(df["year"] > 2014) & (df["region"]=="Albany")] #Loc funciona pero realmnte NO LO NECESITO

In [ ]:
filtrado.head(2)

Sintaxis del loc con varias condiciones
```python 
df.loc[(df["columna"] condición) & (df["columna"] condición)]
````

Misma operación, pero dame solo columnas concretas

In [ ]:
# Esta selección de columnas la vimos al principio, pasarle una lista para que coja solo las columnas que quiero

In [ ]:
filtrado_ = df.loc[(df["year"] > 2014) & (df["region"]=="Albany"), ["type", "year", "region"]]
filtrado_ .head()

## Ordenamos un dataframe

In [ ]:
df.sort_values(by="year",ascending=False).head() #Ascending FALSE de mayor a menor

In [ ]:
df.sort_values(by="year",ascending=False)["averageprice"].head() #Ascending FALSE de mayor a menor

In [ ]:
guardar_ordenado = df.sort_values(by="large_bags") #Lo puedo guardar en una variable

In [ ]:
guardar_ordenado.head()

In [ ]:
df.sort_values(by=["date", "region"]).head() #ORDENAR POR VARIAS COLUMNAS

### Buscamos valores nulos

In [ ]:
import seaborn as sns

In [ ]:
df_titanic = sns.load_dataset("titanic")
df_titanic.head()

#### ¿Es nulo?

In [ ]:
df_titanic.isna().head()

#### ¿Es NO nulo?

In [ ]:
df_titanic.notna().head()

#### Sacar una suma de los valores nulos de cada columna

In [ ]:
df_titanic.isna().sum()

### Borramos los valores nulos
Hay varias formas de hacerlo, tenemos en cuenta el parámetro "how" y, desde luego, [nos leemos la documentación](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

In [ ]:
df_titanic.shape

In [ ]:
#Con "all" borramos donde TODOS los registros sean NaN

In [ ]:
df_titanic.dropna(how="all", inplace=True)

In [ ]:
df_titanic.dropna(inplace=True)

In [ ]:
df_titanic.shape

In [ ]:
# NUNCA BORRAMOS LOS NAN A LO LOCO, OS LO SUPLICO 
# Si no pongo nada, axis = 0 entonces borra todas las filas que contengan un NaN da igual en qué columna
# SI PONGO 1 borramos las columnas

In [ ]:
# si hago drop axis=1 lo que borramos son las columnas, ESTO TAMPOCO LO HACEMOS POR FAVOR
df_titanic.dropna(how="all", axis=1)

In [ ]:
# BORRAMOS LOS REGISTROS DONDE TODO SEA NAN (poner axis=0 es lo mismo que nada porque viene por defecto)
# si hago drop axis=1 lo que borramos son las columnas, ESTO TAMPOCO LO HACEMOS POR FAVOR
df_titanic.dropna(how="all", axis=0)

In [ ]:
# Borramos las columnas donde todo sea NAN
df_titanic.dropna(how="all", axis=1)

RECORDAD QUE INPLACE TRUE ES PARA QUE EL MÉTODO ACCIONE SOBRE EL DF, SI NO, TENGO QUE GUARDARLO EN UNA VARIABLE NUEVA

🧨🧨🧨🧨

Con "any" (**parámetro por default**  👀 con no poner nada) se borran todos los registros en los que en ***alguna columna*** haya un NaN 

🧨🧨🧨🧨

### Cómo rellenar los datos que faltan

¿Qué os parece un poquito de  📚[DOCU](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

In [ ]:
df_titanic.head()

In [ ]:
df_titanic.isna().sum()

In [ ]:
#FILLNA es el método que me va a permitir rellenar los NAN con lo que yo le ponga
df_titanic.age.fillna(df_titanic.age.mean(), inplace=True)

In [ ]:
df_titanic.age.isna().sum()

In [ ]:
df_titanic.embarked.fillna("Otracosa",inplace=True)

In [ ]:
df_titanic.loc[df_titanic["embarked"] == "Otracosa"]

##### CATEGÓRICAS EN DATAFRAME 
🔎📚➡[DOCU](https://runebook.dev/es/docs/pandas/user_guide/categorical)

In [ ]:
df_titanic = sns.load_dataset("titanic")
df_titanic.head()

In [ ]:
df_titanic.info()

In [ ]:
df_titanic.deck.value_counts()

In [ ]:
df_titanic.deck.isna().sum()

In [ ]:
df_titanic.deck.values.categories

In [ ]:
#df_titanic.deck.fillna("Unknown", inplace=True) # ERROR LO DEJO A PROPÓSITO porque no puedo añadir una categoría que no está

In [ ]:
df_titanic.deck.cat.add_categories("Desconocido", inplace=True)

In [ ]:
df_titanic.deck.values.categories

In [ ]:
df_titanic.deck.fillna("Desconocido", inplace=True) # Ahora ya puedo hacer fillna con Desconocido

In [ ]:
# ValueError: Cannot setitem on a Categorical with a new category, set the categories first
df_titanic.info()

In [ ]:
joder = [{"key": 5},{"key":6.3}]

In [ ]:
quesale = pd.DataFrame(joder)
quesale.info()

In [ ]:
quesale.to_csv("probando", index=False)

In [ ]:
data = pd.read_csv("probando")

In [ ]:
data.head()

In [ ]:
data.info()

In [ ]:
data.to_csv("otravez", index=False)

## Borramos los duplicados

In [ ]:
df_titanic.drop_duplicates().head()

In [ ]:
np.isnan(df.loc[3]["large_bags"])

In [ ]:
df.loc[3]["type"]

# Agregación de datos
## GroupBy (nos suena?? 🤔)
GroupBy de Pandas es una función potente y versátil en Python. Nos permite dividir sus datos en grupos separados para realizar cálculos para un mejor análisis.
Un DataFrame puede agruparse en sus filas (eje=0) o en sus columnas (eje=1). Una vez hecho esto, se aplica una función a cada grupo, produciendo un nuevo valor. Finalmente, los resultados de todas esas aplicaciones de funciones se combinan en un objeto resultado. La forma del objeto resultante dependerá normalmente de lo que se haga con los datos.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [ ]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

In [ ]:
df.head()

Supongamos que queremos calcular la media de la columna data1 utilizando las etiquetas de key1. Hay varias formas de hacerlo. Una es acceder a datos1 y llamar a groupby con la columna (una Serie) en key1.
Los datos (una Serie) han sido agregados según la clave de grupo, produciendo una nueva Serie que ahora está indexada por los valores únicos de la columna clave1. El índice resultante tiene el nombre 'clave1' porque la columna DataFrame `df['clave1']` lo hizo.

In [ ]:
group = df["data1"].groupby(df["key1"]).mean()

In [ ]:
group # ESTO ES UNA SERIE DE PANDAS

In [ ]:
type(group)

In [ ]:
dataframe = pd.DataFrame(df["data1"].groupby(df["key1"]).mean())

In [ ]:
dataframe

In [ ]:
avocado = pd.read_csv("../datasets/avocado_kaggle.csv")
avocado.sample()

In [ ]:
avocado["AveragePrice"].groupby(avocado["type"]).mean()

### Pero, ¿y si quiero agrupar por más columnas?

In [ ]:
df.groupby(["key1", "key2"]).mean()

Otra forma de groupby con sintaxis agg     
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
- count

In [ ]:
df.groupby("key1").agg({"data1": "sum"})

In [ ]:
df.groupby("key2").agg({"data1": "sum", "data2":"mean"})

In [ ]:
avocado.sample()

In [ ]:
avocado.groupby("region").agg({"AveragePrice":"mean", "Total Bags": "sum"})

In [ ]:
meloguardo = avocado.groupby(["region", "type"]).agg({"AveragePrice":"mean", "Total Bags": "sum"})

In [ ]:
meloguardo.head(20)

In [ ]:
# Esto es lo mismo que lo anterior, añado la columna AGE y al final hago la media

In [ ]:
df_titanic.groupby(["sex", "class"]).agg({"age":"mean"})

## Uniendo de Dataframes
- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html


## Concat
Unimos dataframes a lo largo del axis 0 uno debajo de otro. Alinea las columnas por etiqueta. Lo que viene siendo un union de SQL verdad?

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')

In [ ]:
df.head()

In [ ]:
uno=df.sample(frac=0.3)
dos=df.sample(frac=0.4)

In [ ]:
uno.head()

In [ ]:
dos.head()

In [ ]:
uno.shape, dos.shape

In [ ]:
pd.concat([uno, dos]).head()  # esto recibe una lista de dataframes

In [ ]:
concatenado=pd.concat([uno, dos])

concatenado.shape

In [ ]:
# Podemos concatenar uno al lado del otro pero tienen que tener el mismo número de filas

In [ ]:
concat_h=pd.concat([uno, uno], axis=1)

In [ ]:
concat_h.head()

### Merge

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) es más útil cuando se desea combinar filas que comparten datos.

In [ ]:
df1=pd.DataFrame({'lkey': ['k0', 'k1', 'k2'],
                   'B': [1, 2, 3]})

df2=pd.DataFrame({'rkey': ['k0', 'k1', 'k2'],
                   'B': [4, 6, 7]})

In [ ]:
df3=pd.DataFrame({'rkey': ['k0', 'k1', 'k2'],
                   'Otracol': [4, 6, 7]})

In [ ]:
df1.head()

In [ ]:
df2.head()

In [ ]:
mergeado=df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=['_izq', 'dcha'])

mergeado

In [ ]:
df3.head()

In [ ]:
mer_merge=mergeado.merge(df3, left_on='lkey', right_on='rkey')

In [ ]:
mer_merge.head()

In [ ]:
# Una vez hemos mergeado, nos interesa eliminar la columna repetida

In [ ]:
mer_merge.drop(columns=['rkey_x', 'rkey_y'])

# Cuando no me coinciden los datos

In [ ]:
df1=pd.DataFrame({'lkey': ['k0', 'k1', 'k2'],
                   'B': [1, 2, 3]})

df2=pd.DataFrame({'rkey': ['k0', 'k1', 'k3'],
                   'B': [4, 6, 7]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.merge(df2, left_on='lkey', right_on='rkey')

In [ ]:
uno_2=pd.DataFrame({'nombre_uno': ['ras', 'sonia', 'ana', 'dobby', 'k4'],
                  'dirección': ['calle fantasía', 'a1', 'a2', 'a3', 'a4']})

otro_2=pd.DataFrame({'nombre_dos': ['ras', 'ana', 'sonia'],
                  'teléfono': ['7245689247', 'b1', 'b2']})

In [ ]:
 # Si no pongo how es un INNER y borra donde no haya match

In [ ]:
uno_2.merge(otro_2, left_on='nombre_uno', right_on='nombre_dos')

In [ ]:
uno_2.merge(otro_2, left_on='nombre_uno', right_on='nombre_dos', how='right').drop('nombre_dos', axis=1)

## Join
El join, a diferencia del merge, va a unir los dataframes y donde no haya registros en el "índice" va a poner NaN

In [ ]:
uno=pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3', 'k4'],
                  'A': ['a0', 'a1', 'a2', 'a3', 'a4']})

otro=pd.DataFrame({'key': ['k0', 'k1', 'k2'],
                  'B': ['b0', 'b1', 'b2']})

In [ ]:
uno

In [ ]:
otro

In [ ]:
uno.join(otro, lsuffix='_uno', rsuffix='_dos')

In [ ]:
otro.join(uno, lsuffix='_uno', rsuffix='_dos')

In [ ]:
uno.join(otro, lsuffix='_uno', rsuffix='_dos', how='right')

In [ ]:
otro.join(uno, lsuffix='_uno', rsuffix='_dos', how='left')

In [ ]:
type(uno.join(otro, lsuffix='_uno', rsuffix='_dos'))

## Exportar datos

In [ ]:
otro.to_csv('../datasets/pandas_m,erge.csv')

## Métodos habituales de pandas
```python
df.head()                     # printea la cabeza, por defecto 5 filas
df.tail()                     # pritea la cola, por defecto 5 filas
df.describe()                 # descripcion estadistica
df.info()                     # informacion del df
df.info(memory_usage='deep')
df.columns                    # muestra columna
df.index                      # muestra indice
df.dtypes                     # muestra tipos de datos de las columnas
df.plot()                     # hace un grafico
df.hist()                     # hace un histograma
df.col.value_counts()         # cuenta los valores unicos de una columna
df.col.unique()               # muestra valores unicos de una columna
df.copy()                     # copia el df
df.drop()                     # elimina columnas o filas (axis=0,1)
df.dropna()                   # elimina nulos
df.fillna()                   # rellena nulos
df.shape                      # dimensiones del df
df._get_numeric_data()        # selecciona columnas numericas
df.rename()                   # renombre columnas
df.str.replace()              # reemplaza columnas de strings
df.astype(dtype='float32')    # cambia el tipo de dato
df.iloc[]                     # localiza por indice
df.loc[]                      # localiza por elemento
df.transpose()                # transpone el df
df.T
df.sample(n, frac)            # muestra del df
df.col.sum()                  # suma de una columna
df.col.max()                  # maximo de una columna
df.col.min()                  # minimo de una columna
df[col]                       # selecciona columna
df.col
df.isnull()                   # valores nulos
df.isna()
df.notna()                    # valores no nulos
df.drop_duplicates()          # eliminar duplicados
df.reset_index(inplace=True)  # resetea el indice y sobreescribe
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)